shaonianruntu/PIC18-MCU-Projects/3.电子钟的设计/5110.h
#ifndef __5110_H
#define __5110_H


#include "p18f45k20.h"
#include "ds1302.h"


#define SCLK LATDbits.LATD3
#define SDIN LATDbits.LATD4
#define LCD_DC LATDbits.LATD5
#define LCD_CE LATDbits.LATD6
#define LCD_RST  LATDbits.LATD7


void LCD_init(void);
void LCD_clear(void);
void LCD_move_chinese_string(unsigned char X, unsigned char Y, unsigned char T); 
void LCD_write_english_string(unsigned char X,unsigned char Y,char *s);
void LCD_write_chinese_string(unsigned char X, unsigned char Y,
                   unsigned char ch_with,unsigned char num,
                   unsigned char line,unsigned char row,unsigned char j[][26]);
void chinese_string(unsigned char X, unsigned char Y, unsigned char T);                 
void LCD_write_char(unsigned char c);
void LCD_draw_bmp_pixel(unsigned char X,unsigned char Y,unsigned char *map,
                  unsigned char Pix_x,unsigned char Pix_y);
void LCD_write_byte(unsigned char dat, unsigned char dc);
void LCD_set_XY(unsigned char X, unsigned char Y);
void delay_1us(void);                 
void delay_1ms(void);


#endif